      * A simple hello world implementation
		IDENTIFICATION DIVISION.
		PROGRAM-ID. HelloWorld.
		AUTHOR. Adam Thompson.
		PROCEDURE DIVISION.
		DISPLAY "Hello, World!".
		STOP RUN.
